sdaiGetEntityExtent(Sdai_instS*,Sdai_instS*)
\details
Retrieves a collection of entity instances that are subtypes of entity type described by entity definition.
\param model  [in] The model to get entities collection from.
\param entity [in] The entity definition to find entity instances.
\returns A set of entity instances of the type which is derived from the entity.
\code
SdaiEntity entPropertySingleValue = sdaiGetEntity(model, "IfcPropertySingleValue");
SdaiSet propertySingleValues = sdaiGetEntityExtent(model, entPropertySingleValue);
SdaiInteger cnt = sdaiGetMemberCount(propertySingleValues);
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiMO_NEXS - SDAI-model does not exist.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiED_NDEF - Entity definition not defined.
* sdaiSY_ERR - Underlying system error.